// Задача 60: Сформируйте трёхмерный массив из неповторяющихся двузначных чисел. Напишите программу, которая будет построчно выводить массив, добавляя индексы каждого элемента.

// Как вывести куб построчно, вот в чём вопрос. Это же куб!

Console.WriteLine("Hello, World!");
