// Задача 62: Заполните спирально массив 4 на 4.
// Так именно 4*4? Не любой? Привет, магические числа.
Console.WriteLine("Hello, World!");
